# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMTkxZTU1Ni0wODc4LTQzYzAtOTNiNS0xMjhhNWJmMWQ2OTk7b2JqZWN0SWQ9NjlhM2I0ZjgtYTExOS00NzM0LTk2NTgtZmNiZjdjNjM4M2U2O3N1YnNjcmlwdGlvbklkPTBmMDVlOWQ0LTU5MmItNDkxYS1iOWRhLTQ5YThiMjQyZDBjNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault_secret.admin_conn_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_conn_string" {
        id                      = "https://oed-prod-kv.vault.azure.net/secrets/dd-pgadmin-connection-string/a6fa92717e484e9aa8540c6fbcb5d160"
        name                    = "dd-pgadmin-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.user_conn_string must be replaced
-/+ resource "azurerm_key_vault_secret" "user_conn_string" {
      ~ id                      = "https://oed-prod-kv.vault.azure.net/secrets/dd-pguser-connection-string/9abf52f15f6f4a62b6023b07e0af7909" -> (known after apply)
      ~ name                    = "dd-pguser-connection-string" -> "OedConfig--Postgres--ConnectionString" # forces replacement
      ~ resource_id             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.KeyVault/vaults/oed-prod-kv/secrets/dd-pguser-connection-string/versions/9abf52f15f6f4a62b6023b07e0af7909" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.KeyVault/vaults/oed-prod-kv/secrets/dd-pguser-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      - value_wo_version        = 0 -> null
      ~ version                 = "9abf52f15f6f4a62b6023b07e0af7909" -> (known after apply)
      ~ versionless_id          = "https://oed-prod-kv.vault.azure.net/secrets/dd-pguser-connection-string" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server.pg will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pg" {
        id                                = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
        name                              = "dd-prod-pg"
      ~ tags                              = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_postgresql_flexible_server_database.db will be destroyed
  # (because azurerm_postgresql_flexible_server_database.db is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "db" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg/databases/dd-prod-pg-db" -> null
      - name      = "dd-prod-pg-db" -> null
      - server_id = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg" -> null
    }

  # azurerm_postgresql_flexible_server_database.oed_db will be created
  + resource "azurerm_postgresql_flexible_server_database" "oed_db" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "dd-oed-prod-pg-db"
      + server_id = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-feedpoller-func"
        name                                           = "oed-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/prod/altinn-digdir-oed-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_prod_altinn-digdir-oed-rg.tfstate.tfplan`